public class FourthTask {
//    Нам дана скобочная последовательность: [((())()(())]]
//    Данная скобочная последовательность неверна, т.к. количество открывающих и закрывающих скобок не совпадает
//    Для того, чтобы сделать ее правильной, необходимо посчитать количество скобок.
//    Если количество открывающих скобок больше, чем закрывающих, то необходимо удалить самую правую открывающую скобку
//    Если количество закрывающих скобок больше, чем открывающих, то необходимо удалить самую левую закрывающую скобку
//    В конце проверяем, чтобы количество скобок совпадало
//    В итоге получаем, что правильной будет последовательность: [(())()(())]
}
